//----------------------------------------------------------------
#ifndef _SoD3DUserDefine_h_
#define _SoD3DUserDefine_h_
//----------------------------------------------------------------
extern float SoD3D_BG_ClearColor[4];
//----------------------------------------------------------------
//摄像机旋转的速度
#define SoD3D_CameraRotateSpeed 0.2f
//自由模式下，摄像机移动的速度
#define SoD3D_CameraMoveSpeed 5.0f
//聚焦模式下，鼠标滚轴的变化值转换成聚焦距离的倍率
#define SoD3D_CameraFocusDistanceScale 0.005f
//----------------------------------------------------------------
#endif //_SoD3DUserDefine_h_
//----------------------------------------------------------------
