//-----------------------------------------------------------------------------
// SoHash
// (C) oil
// 2013-10-05
//-----------------------------------------------------------------------------
#ifndef _SoHash_h_
#define _SoHash_h_
//-----------------------------------------------------------------------------
#include "SoIntType.h"
//-----------------------------------------------------------------------------
//PHP中出现的字符串Hash函数。
//pszString是带结束符的字符串。
souint32 SoHash_PHP(const char* pszString);

//pszString是带结束符的字符串。
souint32 SoHash_BKDR(const char* pszString);

//本函数得到的hash值分布比较均匀。
//pszString是带结束符的字符串。
souint32 SoHash_Index(const char* pszString);
//-----------------------------------------------------------------------------
#endif //_SoHash_h_
//-----------------------------------------------------------------------------
