//----------------------------------------------------------------
#ifndef _WinInputMsgDispatch_h_
#define _WinInputMsgDispatch_h_
//----------------------------------------------------------------
struct stInputEvent;
//----------------------------------------------------------------
//所有需要响应Input事件的模块，都在这个函数里面排队。
void WinInputMsgDispatch_Process(stInputEvent* pInputEvent);
//----------------------------------------------------------------
#endif //_WinInputMsgDispatch_h_
//----------------------------------------------------------------
